tap "buo/cask-upgrade"

brew "mas"

brew "bash"
brew "bash-completion"

brew "zsh"
# brew "antigen" # zsh plugins
brew "starship"

brew "git"
brew "hub"
brew "diff-so-fancy"
brew "git-delta"

brew "jq"
brew "mtr"
brew "pstree"
brew "pv"
brew "the_silver_searcher"
brew "tree"
brew "watch"
brew "rename"

brew "rbenv"
brew "ruby-build"
brew "node"
brew "nodenv"

brew "rustup-init"

brew "flow" # for javascript

brew "heroku"

# tap "shopify/shopify"
# brew "toxiproxy"

brew "lua"
brew "macvim"

tap "universal-ctags/universal-ctags"
brew "universal-ctags/universal-ctags/universal-ctags", args: ['HEAD']
brew "parallel" # for ctags generation
brew "shellcheck" # syntax for shell scripts

brew "go"
brew "dep"

cask "kap" # screen capturing
cask "wireshark"

brew "httpie"

brew "kubectl"
brew "stern" # for tailing logs

cask "homebrew/cask-versions/adoptopenjdk8" # kafka prerequisite
brew "kafka"
brew "kafkacat"
brew "zookeeper"

# experimental shell improvements
brew "exa" # ls replacement
brew "bat" # cat replacement
brew "prettyping"

# for flashing firmware for ergodox
tap "PX4/homebrew-px4"
brew "dfu-util"
brew "gcc-arm-none-eabi-54"
brew "python3"
brew "cmake"

# for other stuff
tap "homebrew/cask-fonts"
cask "font-fira-code"
cask "font-ia-writer-duo"
cask "font-ia-writer-quattro"
cask "font-iosevka"
# cask "font-iosevka-slab"

cask "docker"
brew "coreutils" # for timeout, for docker-compose builds with puppet

cask "qlmarkdown" # markdown quicklook

brew "fzf"

cask "lunchy"

# for AVR development:
# cask "crosspack-avr"
tap "osx-cross/avr"
# brew "avr-libc" # doesn't exist anymore?
brew "avrdude"

# for qmk firmware:
# tap "osx-cross/avr"
# tap "PX4/homebrew-px4"
# brew "avr-gcc@7"
# brew "dfu-programmer"
# brew "dfu-util"
# brew "gcc-arm-none-eabi"
# brew "avrdude"

cask "graphiql"

# brew "pidof"
