tap "buo/cask-upgrade"

brew "bash"
brew "bash-completion"

brew "git"
brew "hub"
brew "diff-so-fancy"

brew "jq"
brew "mtr"
brew "pstree"
brew "pv"
brew "the_silver_searcher"
brew "tree"
brew "watch"
brew "rename"

brew "rbenv"
brew "ruby-build"
brew "nodenv"

brew "heroku-toolbelt"

brew "lua"
brew "luajit"
brew "macvim", args: ["with-lua", "with-luajit", "override-system-vim"]

tap "universal-ctags/universal-ctags"
brew "universal-ctags/universal-ctags/universal-ctags", args: ['HEAD']
brew "parallel" # for ctags generation
brew "shellcheck" # syntax for shell scripts

brew "go"
brew "dep"

cask "kap" # screen capturing

brew "kubectl"
brew "stern" # for tailing logs

# for flashing firmware for ergodox
tap "PX4/homebrew-px4"
brew "dfu-util"
brew "gcc-arm-none-eabi-54"
brew "python3"
brew "cmake"

# for other stuff
tap "caskroom/homebrew-fonts"
cask "font-fira-code"

cask "docker"

cask "qlmarkdown" # markdown quicklook

brew "fzf"

cask "lunchy"

# for AVR development:
# cask "crosspack-avr"
tap "osx-cross/avr"
brew "avr-libc"
brew "avrdude"

cask "hammerspoon"

cask "graphiql"

# brew "pidof"
