tap "buo/cask-upgrade"

brew "chezmoi"
brew "1password-cli"

brew "zsh"
brew "antigen" # zsh plugins
brew "direnv"
brew "zsh-syntax-highlighting"

brew "shellcheck"
brew "parallel"
brew "fswatch"

brew "git"
brew "git-lfs"
brew "gh"

brew "s3cmd"

brew "jq"
brew "mtr"
brew "pstree"
brew "pv"
brew "the_silver_searcher"
brew "rg"
brew "tree"
brew "watch"
brew "rename"

brew "rbenv"
brew "ruby-build"
brew "node"
brew "nodenv"
brew "rustup-init"
brew "flow" # for javascript

brew "heroku"

brew "go"

cask "kap" # screen capturing
cask "wireshark"

# brew "kubectl"
# brew "kubectx"
# brew "stern" # for tailing logs

brew "kcat"

# experimental shell improvements
brew "exa" # ls replacement
brew "bat" # cat replacement
brew "prettyping"

# for other stuff
tap "homebrew/cask-fonts"
cask "font-fira-code"
cask "font-ia-writer-duo"
cask "font-ia-writer-quattro"
cask "font-iosevka"
# cask "font-iosevka-slab"

# cask "docker"
# brew "coreutils" # for timeout, for docker-compose builds with puppet

cask "qlmarkdown" # markdown quicklook

brew "fzf"
brew "lunchy"

# for flashing firmware for ergodox
# tap "PX4/homebrew-px4"
# brew "dfu-util"
# brew "gcc-arm-none-eabi-54"
# brew "python3"
# brew "cmake"

# for AVR development:
# cask "crosspack-avr"
# tap "osx-cross/avr"
# brew "avr-libc" # doesn't exist anymore?
# brew "avrdude"

cask "graphiql"
